nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/multiprocessor_examples/erpc_server_matrix_multiply_i2c/cm33_core0/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_EN 0x0400u    /*!<@brief Pseudo Output Drain is enabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */
#define PCOR_PTCO2_ptco1 0x01u            /*!<@brief Port Clear Output: Corresponding field in PDOR becomes 0 */
#define PDDR_PDD2_pdd1 0x01u              /*!<@brief Port Data Direction: Output */

/*! @name PIO3_2 (coord D2), GPIO_HANDSHAKE
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_GPIO_HANDSHAKE_PERIPHERAL GPIO3
/*!
 * @brief Signal name */
#define BOARD_INITPINS_GPIO_HANDSHAKE_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITPINS_GPIO_HANDSHAKE_CHANNEL 2

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPINS_GPIO_HANDSHAKE_GPIO GPIO3
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPINS_GPIO_HANDSHAKE_GPIO_PIN_MASK (1U << 2U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_GPIO_HANDSHAKE_PORT 3U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_GPIO_HANDSHAKE_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_GPIO_HANDSHAKE_PIN_MASK (1U << 2U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
